app/controllers/gemsets_controller.rb

SELECT "gemsets".* FROM "gemsets"
---
  def index
    @gemsets = Gemset.all

SELECT "gemsets".* FROM "gemsets" WHERE "gemsets"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @gemset = Gemset.find(params[:id])

SELECT "gemsets".* FROM "gemsets" WHERE "gemsets"."id" = $1 LIMIT 1  [["id", "5"]]
---
  def edit
    @gemset = Gemset.find(params[:id])

INSERT INTO "gemsets" ("created_at", "nombre", "proyecto_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 09 May 2013 14:30:20 UTC +00:00], ["nombre", "gemasv1"], ["proyecto_id", 1], ["updated_at", Thu, 09 May 2013 14:30:20 UTC +00:00]]
---
  def create
      @gemset = Gemset.new(params[:gemset])

    respond_to do |format|
      if @gemset.save

SELECT "gemsets".* FROM "gemsets" WHERE "gemsets"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "gemsets" WHERE "gemsets"."id" = $1  [["id", 1]]
---
  def destroy
    @gemset = Gemset.find(params[:id])
    @gemset.destroy

SELECT "gemsets".* FROM "gemsets" WHERE "gemsets"."id" = $1 LIMIT 1  [["id", "10"]]
---
  def alta_version
    @gemset = Gemset.find(params[:id])