app/controllers/proyectos_controller.rb

SELECT "proyectos".* FROM "proyectos"
---
  def index
    @proyectos = Proyecto.all

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "gemsets".* FROM "gemsets" WHERE (proyecto_id = 1)
---
  def show
    @proyecto = Proyecto.find(params[:id])
    @gemsets = Gemset.where('proyecto_id = ?',@proyecto.id )

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @proyecto = Proyecto.find(params[:id])

INSERT INTO "proyectos" ("created_at", "descripcion", "nombre", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 09 May 2013 12:31:20 UTC +00:00], ["descripcion", "Perez"], ["nombre", "Jose"], ["updated_at", Thu, 09 May 2013 12:31:20 UTC +00:00], ["usuario_id", 1]]
---
  def create
    @proyecto = Proyecto.new(params[:proyecto])

    respond_to do |format|
      if @proyecto.save

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "proyectos" SET "nombre" = 'gitgem', "descripcion" = 'gestionar gemas', "updated_at" = '2013-05-09 12:32:54.282194' WHERE "proyectos"."id" = 1
---
  def update
    @proyecto = Proyecto.find(params[:id])

    respond_to do |format|
      if @proyecto.update_attributes(params[:proyecto])

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def alta_gemset
    @proyecto = Proyecto.find(params[:id])